{
  "backend/main.mo": "Defines the backend actor with user profiles, incidents, evidence, stalker profiles, police departments, and settings, using access control and blob storage mixins. Implements create/read operations for user data and incident reporting.",
  "feature_evidence.json": "Feature description specifying a splash message string change and the affected frontend file with metadata for components and tests.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files describing their purpose, UI behavior, and workflow roles.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining OKLCH theme variables for light and dark modes and applying base background/foreground styles.",
  "frontend/index.html": "HTML entry point setting page metadata, mounting the root element, and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React app that manages authentication state, post-login splash logic, profile setup flow, and renders either the authenticated app or HomePage.",
  "frontend/src/components/auth/PostLoginSplash.tsx": "Displays a post-login splash with a random message and media, optionally using a user-uploaded motivational video before continuing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter and save their profile name before proceeding into the app.",
  "frontend/src/components/layout/AppShell.tsx": "Top-level layout providing header, authentication controls, settings access, content container, and footer for the entire app.",
  "frontend/src/components/settings/SettingsDialog.tsx": "A settings dialog that loads, edits, and saves user settings and uploads an optional motivational video.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state and helpers using Internet Identity, loading stored identity and handling login/logout.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, incidents, stalker profiles, evidence, police data, and user settings.",
  "frontend/src/index.css": "Tailwind base styles plus theme variables for default, dark, and women’s safety themes.",
  "frontend/src/main.tsx": "App entry point that initializes React, React Query, Internet Identity, and global styles.",
  "frontend/src/pages/AuthenticatedApp.tsx": "Main authenticated UI with tab navigation and dynamic theme application based on user settings.",
  "frontend/src/pages/HomePage.tsx": "Landing page with login handling, CTA regression checks, and navigation to incidents.",
  "frontend/src/pages/workflow/EvidenceRecordDetail.tsx": "Drawer showing detailed evidence info with preview, metadata, and download link.",
  "frontend/src/pages/workflow/EvidenceRecordPage.tsx": "Page for uploading new evidence, listing existing items, and viewing evidence details.",
  "frontend/src/pages/workflow/EvidenceSummaryDialog.tsx": "Dialog generating and displaying a text summary of multiple evidence records with copy/download options.",
  "frontend/src/pages/workflow/IncidentDetailDrawer.tsx": "Drawer showing incident details, status, report number copy, and evidence count.",
  "frontend/src/pages/workflow/IncidentsPage.tsx": "Incident reporting dashboard with search, creation form, list view, and summary panel.",
  "frontend/src/pages/workflow/IncidentsSummaryPanel.tsx": "Displays a dialog showing a generated incident summary with options to copy or download it.",
  "frontend/src/pages/workflow/InstallGuidePage.tsx": "Provides installation instructions for iOS, Android, and desktop browsers to add the app to a home screen.",
  "frontend/src/pages/workflow/MessageGeneratorPage.tsx": "Generates customizable cease‑and‑desist messages based on tone and optional incident selection, with copy and SMS actions.",
  "frontend/src/pages/workflow/PoliceDepartmentsPage.tsx": "Lets users view, search, and save police departments and submit police reports, including a manual add form.",
  "frontend/src/pages/workflow/ResourcesPage.tsx": "Lists national victim‑support hotlines and resource organizations with phone numbers and website links.",
  "frontend/src/pages/workflow/StalkerProfilesPage.tsx": "Displays saved stalker profiles and provides a form to create new profiles with descriptive details.",
  "frontend/src/pages/workflow/SubmitPoliceReportDialog.tsx": "Dialog component that lets users select a police department and generate, copy, or download a combined incidents‑and‑evidence report.",
  "frontend/src/pages/workflow/VictimSurvivorInfoPage.tsx": "Page for viewing, editing, saving, and clearing optional victim/survivor personal information stored on‑chain.",
  "frontend/src/utils/datetime.ts": "Utility functions to format bigint timestamps into readable date/time strings for UI use.",
  "frontend/src/utils/download.ts": "Provides a helper to trigger browser downloads of plain text files via Blob and temporary links.",
  "frontend/src/utils/files.ts": "File validation and conversion utilities for checking size limits, MP4 rules, and reading files into Uint8Array.",
  "frontend/src/utils/generateEvidenceSummary.ts": "Builds a text evidence summary report with tone-specific headers, overviews, timelines, and closings.",
  "frontend/src/utils/googleSearch.ts": "Opens a Google search in a new tab using city, state, and query parameters.",
  "frontend/src/utils/incidentSummary.ts": "Generates a detailed incident summary report with timeline, stats, and basic keyword pattern analysis.",
  "frontend/src/utils/incidentText.ts": "Creates a short formatted incident reference string including title, report number, and timestamp.",
  "frontend/src/utils/landingCtaRegressionCheck.ts": "Development tool that checks whether a CTA element is clickable and logs or throws when overlays block pointer events.",
  "frontend/src/utils/messageGenerator.ts": "Generates cease‑and‑desist style messages with varying tones and optional incident references.",
  "frontend/src/utils/policeDeptSaveRegressionCheck.ts": "Development check that warns if a saved police department is missing from the refreshed list.",
  "frontend/src/utils/policeReport.ts": "Builds a formatted police report combining incident summaries, evidence summaries, and optional department details.",
  "frontend/src/utils/postLoginSplashImages.ts": "Provides a pool of fallback mugshot-style images and returns a random one.",
  "frontend/src/utils/postLoginSplashMessages.ts": "Stores fixed intense accountability messages and returns one at random.",
  "frontend/src/utils/smsLink.ts": "Creates an SMS link with optional recipient and warns for very long messages.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, including hash-based routes.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending fonts, colors, shadows, and components with plugins.",
  "project_state.json": "Metadata describing project state, features, issues, and configuration for the Time4jail project."
}