{
  "backend/main.mo": "Motoko backend actor defining user profiles, incidents, evidence, stalker profiles, police departments, and settings with authorization checks and storage mixins.",
  "feature_evidence.json": "JSON feature manifest describing landing‑page text updates and associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Reference file containing prewritten summaries for all major frontend components and workflow pages.",
  "frontend/index.css": "Global Tailwind base styles defining OKLCH theme tokens for light and dark modes with shared CSS variables.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx with the site title set to Time4jail.",
  "frontend/src/App.tsx": "Main React app that manages authentication state, user profile setup flow, and switches between HomePage and AuthenticatedApp.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting first‑time authenticated users to enter and save their name using a profile‑save mutation.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper providing header, footer, navigation, settings dialog, and logout handling for authenticated views.",
  "frontend/src/components/settings/SettingsDialog.tsx": "A settings dialog that loads user settings, allows selecting theme, tone, and language, and saves updates via backend mutations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, recreating and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity authentication, handling login, identity persistence, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, incidents, evidence, stalker profiles, and settings via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind CSS layers and multiple color themes, including default, dark, and womenSafety themes using CSS variables.",
  "frontend/src/main.tsx": "Application entry point that mounts React, initializes QueryClient, and wraps the app with InternetIdentityProvider.",
  "frontend/src/pages/AuthenticatedApp.tsx": "Main authenticated UI with tab navigation, applying user-selected theme and rendering workflow pages based on active tab.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero messaging, authentication via Internet Identity, and conditional UI based on login state.",
  "frontend/src/pages/workflow/EvidenceRecordDetail.tsx": "Drawer sheet displaying a single evidence file with metadata, preview rendering, and download access.",
  "frontend/src/pages/workflow/EvidenceRecordPage.tsx": "Page for uploading new evidence, listing existing evidence, linking items to incidents, and viewing details in a drawer.",
  "frontend/src/pages/workflow/IncidentDetailDrawer.tsx": "Drawer showing incident details including report number, status, description, and linked evidence count.",
  "frontend/src/pages/workflow/IncidentsPage.tsx": "Incident management page for creating, filtering, viewing, and summarizing reported incidents.",
  "frontend/src/pages/workflow/IncidentsSummaryPanel.tsx": "Dialog summarizing all incidents with copy and download options.",
  "frontend/src/pages/workflow/InstallGuidePage.tsx": "Provides PWA install instructions for iOS, Android, and desktop, plus a short explanation of benefits.",
  "frontend/src/pages/workflow/MessageGeneratorPage.tsx": "Generates customizable cease‑and‑desist messages based on tone and optional incident data with options to copy or send via SMS.",
  "frontend/src/pages/workflow/PoliceDepartmentsPage.tsx": "Allows users to search for, view, and save police department contact info, including a Google search helper and manual entry form.",
  "frontend/src/pages/workflow/ResourcesPage.tsx": "Displays a set of national crime‑help hotlines and resource links, plus an emergency section advising users to call 911.",
  "frontend/src/pages/workflow/StalkerProfilesPage.tsx": "Lets users create and manage profiles documenting individuals involved in stalking, including descriptions and notes.",
  "frontend/src/pages/workflow/VictimSurvivorInfoPage.tsx": "React page that loads, edits, saves, and clears victim/survivor personal info using form fields and backend mutation hooks.",
  "frontend/src/utils/datetime.ts": "Utility functions to format bigint timestamps into display strings, input-friendly dates, and short dates.",
  "frontend/src/utils/download.ts": "Creates and triggers download of a text file via a Blob and temporary link.",
  "frontend/src/utils/files.ts": "Provides file-size validation and converts File objects to Uint8Array using FileReader.",
  "frontend/src/utils/googleSearch.ts": "Opens a Google search in a new tab using combined and encoded city, state, and query terms.",
  "frontend/src/utils/incidentSummary.ts": "Generates a multi-section text summary of incidents, including timeline details and basic keyword pattern analysis.",
  "frontend/src/utils/incidentText.ts": "Formats a single incident into a short reference string with title and timestamp.",
  "frontend/src/utils/messageGenerator.ts": "Generates cease‑and‑desist style messages in various tones, optionally including an incident reference.",
  "frontend/src/utils/smsLink.ts": "Builds an SMS deep-link URL with encoded message and optional phone number, warning on long messages.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL or hash parameters, persisting them in sessionStorage, and clearing stored values.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, plugins, and container settings for the frontend.",
  "project_state.json": "Defines the project’s current version, expanded scope into a women’s‑safety incident documentation app, architectural notes for personalization, evidence handling, SMS and police lookup, PWA support, and tracked existing features. Contains no known issues and is not a fix request."
}