{
  "backend/main.mo": "Defines backend actor with user profiles, incidents, stalker profiles, evidence files, victim info, police departments, and related CRUD logic using authorization and blob storage mixins.",
  "feature_evidence.json": "Lists three feature requirements modifying messaging and evidence summary behavior and maps each to affected frontend utility files.",
  "frontend-file-summaries.txt": "Provides prewritten one‑line summaries for major frontend files covering pages, components, hooks, and configuration.",
  "frontend/index.css": "Defines global CSS variables and light/dark theme tokens plus Tailwind layers for consistent theming.",
  "frontend/index.html": "HTML entry point setting up the root container and loading the main React script.",
  "frontend/src/App.tsx": "Main React app container managing authentication state, profile setup flow, post‑login splash, and routing into authenticated or public views.",
  "frontend/src/components/auth/PostLoginSplash.tsx": "Displays a modal splash screen after login with a random motivational message and a dismiss button.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting first‑time users to enter and save their profile name with basic validation and save handling.",
  "frontend/src/components/layout/AppShell.tsx": "Layout component providing header, footer, settings dialog control, and logout handling with dynamic header height measurement.",
  "frontend/src/components/settings/SettingsDialog.tsx": "Settings modal allowing users to change visual theme, tone style, and language, with saving via backend and immediate theme application.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing a backend actor tied to the user's identity, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity auth flow, loading stored identities, login, logout, and exposing identity state.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, incidents, evidence, stalker profiles, and user settings via the backend actor.",
  "frontend/src/index.css": "Tailwind base styles plus custom themes including default dark purple theme and additional variant themes using CSS variables.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, and Internet Identity provider before rendering the app.",
  "frontend/src/pages/AuthenticatedApp.tsx": "Main authenticated interface with tab navigation, theme application, and URL-hash‑synced routing to workflow pages.",
  "frontend/src/pages/HomePage.tsx": "Public landing page handling Internet Identity login, CTA validation, and redirect prep for authenticated workflow.",
  "frontend/src/pages/workflow/EvidenceRecordDetail.tsx": "Drawer showing full evidence details with previews, metadata, and download access.",
  "frontend/src/pages/workflow/EvidenceRecordPage.tsx": "Evidence listing and upload form allowing users to create, view, and link evidence files to incidents.",
  "frontend/src/pages/workflow/EvidenceSummaryDialog.tsx": "Dialog generating and displaying an evidence summary with tone options and copy/download actions.",
  "frontend/src/pages/workflow/IncidentDetailDrawer.tsx": "Drawer displaying incident details, report info, status, and attached evidence count with copy support.",
  "frontend/src/pages/workflow/IncidentsPage.tsx": "Displays, filters, and sorts incidents, provides a form to report new incidents, and opens detail and summary views.",
  "frontend/src/pages/workflow/IncidentsSummaryPanel.tsx": "Shows a generated summary of all incidents in a dialog with options to copy or download it.",
  "frontend/src/pages/workflow/InstallGuidePage.tsx": "Static install instructions for adding the app to iOS, Android, and desktop home screens.",
  "frontend/src/pages/workflow/MessageGeneratorPage.tsx": "Generates templated messages based on tone and optional incident references, with copy and SMS‑send options.",
  "frontend/src/pages/workflow/PoliceDepartmentsPage.tsx": "Manages personal and verified police departments, supports adding new entries, searching, and submitting reports.",
  "frontend/src/pages/workflow/ResourcesPage.tsx": "Lists national crime‑help resources with phone numbers and links, plus an emergency call reminder.",
  "frontend/src/pages/workflow/StalkerProfilesPage.tsx": "Page for viewing and creating stalker profiles, including form handling and save mutations.",
  "frontend/src/pages/workflow/SubmitPoliceReportDialog.tsx": "Dialog that generates a police report from incidents and evidence, allowing department selection, copy, and download.",
  "frontend/src/pages/workflow/VictimSurvivorInfoPage.tsx": "Page for viewing, editing, and clearing victim/survivor personal info with blockchain-backed storage.",
  "frontend/src/utils/datetime.ts": "Utility functions for formatting timestamps into readable date strings.",
  "frontend/src/utils/download.ts": "Utility to download text content as a file using a temporary Blob and link.",
  "frontend/src/utils/files.ts": "File validation (size limit) and conversion utilities for reading files into Uint8Array.",
  "frontend/src/utils/generateEvidenceSummary.ts": "Generates a text summary of evidence items with tone-specific headers and descriptions.",
  "frontend/src/utils/googleSearch.ts": "Opens a new tab with a Google search query built from city, state, and terms.",
  "frontend/src/utils/incidentSummary.ts": "Generates a detailed incident summary report including timeline and pattern analysis.",
  "frontend/src/utils/incidentText.ts": "Formats a short incident reference string with title and timestamp.",
  "frontend/src/utils/landingCtaRegressionCheck.ts": "Checks whether a CTA button is unobstructed by overlays by testing center and corner clickability, throwing errors or warnings if blocked.",
  "frontend/src/utils/messageGenerator.ts": "Generates cease‑and‑desist style messages in varying tones using predefined templates and optional incident references.",
  "frontend/src/utils/policeDeptSaveRegressionCheck.ts": "Development-only check that warns if a saved police department does not appear in the refreshed list.",
  "frontend/src/utils/policeReport.ts": "Builds a formatted police report combining department info, incident summaries, and evidence summaries.",
  "frontend/src/utils/postLoginSplashMessages.ts": "Provides a fixed set of motivational, safety-focused post-login messages and a function to return a random one.",
  "frontend/src/utils/smsLink.ts": "Creates an SMS deep link with an encoded message and optional phone number, warning if the message is very long.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions including colors, typography, container settings, animations, and plugins.",
  "project_state.json": "Describes the project's current features, design goals, issues, and architectural notes for the women’s safety app."
}