{
  "backend/main.mo": "Motoko canister defining user profiles, incidents, stalker profiles, evidence storage, police departments, and user settings with access control and mixed-in authorization/storage.",
  "feature_evidence.json": "Feature metadata listing two frontend feature changes related to splash messages and mugshot fallback images, including affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files across routing, UI layout, workflows, hooks, and theming.",
  "frontend/index.css": "Global Tailwind-based CSS defining OKLCH color tokens, themes, dark mode variants, and base element styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and setting the page title to Time4jail.",
  "frontend/src/App.tsx": "Top-level React component handling authentication state, post-login splash logic, profile setup flow, and routing into authenticated or home views.",
  "frontend/src/components/auth/PostLoginSplash.tsx": "Splash screen showing a random message and either a user video or random fallback image, with loading and error handling.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Dialog prompting first-time users to enter a name and save their profile using a backend mutation.",
  "frontend/src/components/layout/AppShell.tsx": "App layout component that renders header, auth controls, settings dialog, main content, and footer while handling login/logout and header height offset.",
  "frontend/src/components/settings/SettingsDialog.tsx": "Modal dialog for updating user settings including theme, tone, language, and motivational video upload with validation and progress tracking.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on the user's identity and invalidates related queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login, logout, status tracking, and persisted identity handling via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend actor calls for user profiles, incidents, stalker profiles, evidence, police departments, and user settings.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables defining multiple color themes, including default, dark, and womenSafety themes.",
  "frontend/src/main.tsx": "Application entrypoint that initializes React, QueryClient, and InternetIdentityProvider before rendering the main App component.",
  "frontend/src/pages/AuthenticatedApp.tsx": "Main authenticated interface with tab-based navigation, syncing theme and URL hash while rendering workflow pages.",
  "frontend/src/pages/HomePage.tsx": "Public landing page handling login flow, CTA checks, and redirecting authenticated users toward the incidents workflow.",
  "frontend/src/pages/workflow/EvidenceRecordDetail.tsx": "Drawer showing detailed evidence info with previews, metadata, and download support based on file type.",
  "frontend/src/pages/workflow/EvidenceRecordPage.tsx": "Evidence management page allowing users to upload, view, and link evidence files to incidents with progress tracking.",
  "frontend/src/pages/workflow/EvidenceSummaryDialog.tsx": "Dialog generating, displaying, and exporting an AI‑generated evidence summary in various tones.",
  "frontend/src/pages/workflow/IncidentDetailDrawer.tsx": "Drawer displaying incident details including timestamps, report numbers, status, description, and evidence count.",
  "frontend/src/pages/workflow/IncidentsPage.tsx": "Page for viewing, searching, sorting, creating, and inspecting incident reports with optional summary and detail drawers.",
  "frontend/src/pages/workflow/IncidentsSummaryPanel.tsx": "Dialog that displays a generated incident summary with options to copy or download it.",
  "frontend/src/pages/workflow/InstallGuidePage.tsx": "Provides step‑by‑step installation instructions for adding the app to iOS, Android, and desktop devices.",
  "frontend/src/pages/workflow/MessageGeneratorPage.tsx": "Generates customizable cease‑and‑desist messages based on tone and optional incident references with copy and SMS features.",
  "frontend/src/pages/workflow/PoliceDepartmentsPage.tsx": "Allows users to find, add, and save police departments, view verified listings, and submit police reports.",
  "frontend/src/pages/workflow/ResourcesPage.tsx": "Displays national crime‑help resources with contact info and links, plus emergency guidance.",
  "frontend/src/pages/workflow/StalkerProfilesPage.tsx": "Renders a page for listing and creating stalker profiles, including a form to save new profiles using query hooks.",
  "frontend/src/pages/workflow/SubmitPoliceReportDialog.tsx": "Dialog component that generates, previews, and exports a combined police report using incidents, evidence, and selected departments.",
  "frontend/src/pages/workflow/VictimSurvivorInfoPage.tsx": "Page for viewing, editing, and clearing optional victim/survivor personal information using blockchain-backed storage.",
  "frontend/src/utils/datetime.ts": "Utility functions to format bigint timestamps into readable strings and input-friendly date formats.",
  "frontend/src/utils/download.ts": "Creates and triggers a client-side download of plain text content via a generated Blob URL.",
  "frontend/src/utils/files.ts": "Validates file size and type, and converts uploaded files to Uint8Array buffers.",
  "frontend/src/utils/generateEvidenceSummary.ts": "Builds a styled evidence summary report with tone-based headers, descriptions, and a chronological log.",
  "frontend/src/utils/googleSearch.ts": "Opens a new Google search window with a query composed from city, state, and custom terms.",
  "frontend/src/utils/incidentSummary.ts": "Generates a multi-section incident summary report with overview, timeline, and basic pattern analysis.",
  "frontend/src/utils/incidentText.ts": "Formats a short reference string for an incident including title, report number, and timestamp.",
  "frontend/src/utils/landingCtaRegressionCheck.ts": "Checks whether a CTA button is clickable by testing its center and corners for overlaying elements and logs or throws errors during development.",
  "frontend/src/utils/messageGenerator.ts": "Generates cease‑and‑desist style messages in varying tones using predefined templates, optionally inserting an incident reference.",
  "frontend/src/utils/policeDeptSaveRegressionCheck.ts": "Development-only check that warns if a saved police department does not appear in the refreshed list of departments.",
  "frontend/src/utils/policeReport.ts": "Builds a police report string including department info, incident summary, and evidence summary using helper generators.",
  "frontend/src/utils/postLoginSplashImages.ts": "Provides a pool of fallback mugshot-style images and returns one at random for the post-login splash screen.",
  "frontend/src/utils/postLoginSplashMessages.ts": "Contains a set of intense accountability-focused splash messages and returns a random one for display.",
  "frontend/src/utils/smsLink.ts": "Creates a cross‑platform SMS link with an encoded message and warns if the message is very long.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters, supporting both query and hash routes.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theming, fonts, colors, animations, and plugin usage.",
  "project_state.json": "Project metadata describing features, requirements, image needs, and current state tracking."
}