{
  "kind": "build_request",
  "title": "Make post-login motivation text and mugshot visuals more intense (accountability-focused)",
  "projectName": "Time4jail",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Revise the post-login splash message pool to be \"extra extra spicy\" in tone while remaining non-profane, non-defamatory, and focused on safety, boundaries, documentation, and legal accountability (update the fixed message list used by the post-login splash).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "question for you - can we make the motivation text along with the mug shots to be extra extra spicy towards the stalker?"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/utils/postLoginSplashMessages.ts is updated with a refreshed set of messages that feel noticeably more intense/assertive than the current list but avoid slurs, profanity, doxxing, or threats of illegal violence",
        "Messages remain short splash-friendly lines (generally 1–2 sentences) and are written in English",
        "The post-login splash continues to display a randomly selected message on each splash view"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Replace the single static fallback image in the post-login splash (used when no motivational video is set) with a small set of generated, generic \"mugshot-style\" visuals and randomly choose one each time the splash is shown.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "question for you - can we make the motivation text along with the mug shots to be extra extra spicy towards the stalker?"
        ]
      },
      "acceptanceCriteria": [
        "Add a small set of new generated mugshot-style images as static assets under frontend/public/assets/generated and use them as the splash fallback instead of the single hard-coded /assets/5425a899ef3d6.image.jpg reference",
        "When no motivational video is available (or video fails), PostLoginSplash shows one randomly selected mugshot-style image from the generated set",
        "When a motivational video is available and loads successfully, PostLoginSplash behavior remains unchanged (video still displays), and the motivation message still displays as it does today"
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn read-only components).",
    "Do not change Internet Identity hooks (frontend/src/hooks/useInternetIdentity.ts / .tsx) or actor initialization hooks (frontend/src/hooks/useActor.ts).",
    "Keep all backend logic within the existing single-actor Motoko backend; no new backend services."
  ],
  "nonGoals": [
    "Do not add profanity, slurs, or targeted hate content.",
    "Do not include identifying details about real individuals in text or images.",
    "Do not add new backend schemas or settings fields for this change."
  ],
  "imageRequirements": {
    "required": [
      "Generic mugshot-style silhouette portrait, grayscale, subtle height chart background (mugshot-1.dim_1024x1024.png)",
      "Generic mugshot-style silhouette portrait, grayscale, subtle height chart background (mugshot-2.dim_1024x1024.png)",
      "Generic mugshot-style silhouette portrait, grayscale, subtle height chart background (mugshot-3.dim_1024x1024.png)",
      "Generic mugshot-style silhouette portrait, grayscale, subtle height chart background (mugshot-4.dim_1024x1024.png)",
      "Generic mugshot-style silhouette portrait, grayscale, subtle height chart background (mugshot-5.dim_1024x1024.png)",
      "Generic mugshot-style silhouette portrait, grayscale, subtle height chart background (mugshot-6.dim_1024x1024.png)"
    ],
    "edits": []
  }
}