{
  "kind": "build_request",
  "title": "Make user-facing tone harsher toward the stalker (legal-accountability, non-violent)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-50",
      "text": "Update the Message Generator templates to use a harsher, women-centered accountability tone toward the stalker while remaining safety-focused and non-violent/non-harassing, and without making actionable threats or encouraging harm.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "can you make the tone harsh towards the stalker?"
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/utils/messageGenerator.ts, the generated messages for tones 'firm', 'severe', and 'very harsh' use noticeably harsher wording toward the stalker (e.g., clearer legal-accountability framing, stronger boundary language) while remaining non-violent and not encouraging harassment or harm.",
        "No template includes violent language, calls for vigilante action, or instructions to harass the stalker.",
        "MessageGeneratorPage continues to render and update the generated message for each tone without runtime errors."
      ]
    },
    {
      "id": "REQ-51",
      "text": "Adjust the fixed post-login splash message pool to include additional harsher, accountability-focused motivational lines (still non-violent and non-harassing) while preserving the required exact existing messages already in the list.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "can you make the tone harsh towards the stalker?"
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/utils/postLoginSplashMessages.ts, the existing required exact messages remain present verbatim: \"Send him to jail.\", \"No meant no.\", \"He will pay for what he did.\", and \"Don't stop until he is in cuffs.\"",
        "The message pool is expanded or revised so that overall tone is harsher toward the stalker (legal-accountability framing), but still avoids violence, harassment, or calls for harm.",
        "Post-login splash (frontend/src/components/auth/PostLoginSplash.tsx) continues to show exactly one randomized message from the updated fixed list per splash session."
      ]
    },
    {
      "id": "REQ-52",
      "text": "Ensure any 'urgent' evidence summary copy remains police-appropriate and can be harsh/accountability-focused without inflammatory labeling; remove or rewrite any wording that characterizes the stalker as a \"threat\" while keeping urgency and safety emphasis.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "can you make the tone harsh towards the stalker?"
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/utils/generateEvidenceSummary.ts, the 'urgent' and 'urgent-feminine' tone copy does not label a real person as a \"threat\" and does not include insults or speculation, while maintaining urgent, safety-focused accountability framing.",
        "Generated evidence summaries remain deterministic and formatted as before (same overall section structure and headings), with only copy changes.",
        "EvidenceSummaryDialog continues to generate summaries for all tone options without errors."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui) must not be edited.",
    "Keep tone safety-focused and non-violent/non-harassing; legal-accountability framing is allowed but do not include calls for harm or harassment.",
    "Do not introduce new backend services or external integrations; keep changes within the existing React/TypeScript frontend."
  ],
  "nonGoals": [
    "Do not change the authentication flow or routing.",
    "Do not add new data models or backend schema changes for tone customization beyond what already exists.",
    "Do not implement AI/LLM-based text generation; keep generation deterministic using existing utilities."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}